# Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и
# возводит число А в целую степень B с помощью рекурсии.

def exponentiate_1(a, b):
    if b < 1:
        return 1
    return a * exponentiate_1(a, b - 1)


a = int(input("Введите число: "))
b = int(input("Введите степень числа: "))
print(f"Число {a} в степени {b} равно {exponentiate_1(a, b)}")

# Атотест. Задача 26:  Напишите программу, которая на вход принимает два числа A и B, и
# возводит число А в целую степень B с помощью рекурсии.

def f(a, b):
    if b < 1:
        return 1
    return a * f(a, b - 1)

# Решение из автотеста

def f(a, b):
  if b == 0:
    return 1
  return f(a, b - 1) * a
